# lim = ["박중후 3.2",
# "김민아 4",
# "최지원 4",
# "신민건 2",
# "박강욱 4",
# "홍지수 4.5",
# "김학겸 2",
# "박서연 1",
# "김유희 3.5",
# "이동해 5",
# "박유상 5",
# "오지수 3",
# "이동훈 3.5",
# "이성은 3.7",
# "강지현 5",
# "김유미 5",
#        "이진혁 2",
#        "이지우 3.5",
#        "김태연 3",
#        "박소민 2",
#        "홍화령 2.5",
#        "이상엽 3",
#        "박주호 3.5",
#        "박재형 3.3",
#        "박준영 2",
#        "최가연 3",
#        "강장훈 3",
#
#
# "이현지 4"]
#
#
# lee = [
# "박중후 3",
# "김민아 4.5",
# "최지원 4",
# "신민건 2",
# "박강욱 2.5",
# "홍지수 4.5",
# "김학겸 2",
# "박서연 2",
# "김유희 1",
# "이동해 4.5",
# "박유상 4",
# "오지수 3",
# "이동훈 3",
# "이성은 4",
# "강지현 4",
# "김유미 4",
# "이진혁 2.5",
# "이지우 4",
# "김태연 2.5",
# "박소민 3.2",
# "홍화령 2",
# "이상엽 2.5",
# "박주호 2.5",
# "박재형 3.5",
# "박준영 3.6",
# "최가연 4",
# "강장훈 3.8",
# "이현지 4",
# ]
# park = [
# "박중후 5",
# "김민아 4",
# "최지원 4",
# "신민건 2",
# "박강욱 3",
# "홍지수 4.2",
# "김학겸 1",
# "박서연 2",
# "김유희 1",
# "이동해 5",
# "박유상 5",
# "오지수 3.5",
# "이동훈 3.5",
# "이성은 4.5",
# "강지현 4",
# "김유미 4",
# "이진혁 3",
# "이지우 4",
# "김태연 4",
# "박소민 2",
# "홍화령 2",
# "이상엽 3",
# "박주호 3",
# "박재형 3.5",
# "박준영 3",
# "최가연 4",
# "강장훈 4.5",
# "이현지 3.8"
# ]
#
# cha = [
# "박중후 3.5",
# "김민아 5",
# "최지원 4",
# "신민건 2",
# "박강욱 3.5",
# "홍지수 3.5",
# "김학겸 1",
# "박서연 2.5",
# "김유희 1",
# "이동해 5",
# "박유상 5",
# "오지수 3",
# "이동훈 4",
# "이성은 5",
# "강지현 5",
# "김유미 5",
# "이진혁 3",
# "이지우 4.5",
# "김태연 2.5",
# "박소민 2",
# "홍화령 3",
# "이상엽 4",
# "박주호 3",
# "박재형 4.5",
# "박준영 3",
# "최가연 3.5",
# "강장훈 5",
# "이현지 3.8"
# ]
# seo = [
# "박중후 4.9",
# "김민아 5",
# "최지원 3.7",
# "신민건 1",
# "박강욱 3.7",
# "홍지수 4",
# "김학겸 1",
# "박서연 2",
# "김유희 1",
# "이동해 5",
# "박유상 5",
# "오지수 3",
# "이동훈 2.6",
# "이성은 4.2",
# "강지현 4.8",
# "김유미 4.5",
# "이진혁 3.2",
# "이지우 3.6",
# "김태연 3.2",
# "박소민 1.3",
# "홍화령 3.5",
# "이상엽 2",
# "박주호 2",
# "박재형 3.1",
# "박준영 1.2",
# "최가연 3.7",
# "강장훈 4.5",
# "이현지 4"
# ]

from collections import defaultdict
from private_data import *

interviewer = [park, cha, lim, lee, seo]

final_dict = defaultdict(float)
final_result = defaultdict(float)
for j in interviewer:
    if len(j) == 28:
        for i in j:
            a, b = i.split(' ')
            b = float(b)
            final_dict[a] += b
    else:
        print(False)
        break

for i in final_dict.items():
    final_result[i[0]] = i[1] / len(interviewer)

sorted_Final = sorted(final_result.items(), key=lambda x: x[1], reverse=True)
for i, final in enumerate(sorted_Final):
    if i == 15:
        print('-------------')

    print(final[0], round(final[1], 3))
